       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQRT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ROOT    PIC 9(4)V9(3).
       01  PREV    PIC 9(4)V9(3).
       LINKAGE SECTION.
       01  INPUT-NUMBER    PIC 9(4)V9(3).
       01  RESULT          PIC 9(4)V9(3).
       PROCEDURE DIVISION USING INPUT-NUMBER, RESULT.
       MAIN-PROCEDURE.
           COMPUTE ROOT = INPUT-NUMBER / 2.
           PERFORM NEW-GUESS UNTIL ROOT = PREV.
           MOVE ROOT TO RESULT.
           GOBACK.

       NEW-GUESS.
           MOVE ROOT TO PREV.
           COMPUTE ROOT = (ROOT + (INPUT-NUMBER/ROOT))/2.

       END PROGRAM SQRT.
