       01  TEST-CONTEXT.
           02  TESTS-RUN       PIC 9(2) VALUE ZEROES.
           02  PASSES          PIC 9(2) VALUE ZEROES.
           02  FAILURES        PIC 9(2) VALUE ZEROES.
